'''
программа вычисления оптимального расстояния между точками "Почта России" Первомайского района Владивостока

'Отделение 63' - 0 индексы отделений
'Отделение 21' - 1
'Отделение 12' - 2
'Отделение 63' - 3
'Отделение 17' - 4
'Отделение 77' - 5
'Отделение 16' - 6
'Отделение 11' - 7
'Отделение 92' - 8
'Отделение 80' - 9


'''

n = 10  #const

distances = [
[0,4,4,3,2.5,3,5,6,10,10], # путь(примерный) от 0-отделения, начиная с i = 0, до j-отделения, j = [1...9]
[4,0,1,2,3,2.5,4,6,11,9], # путь(примерный) от 1-отделения, начиная с i = 1, до j-отделения, j = [1...9]
[5,0.9,0,1.5,3,3,4,6,11,9],
[4,2,1.5,0,4,1.5,2.5,4,9,8],
[4,3,3,4,0,2.5,4,6,11,9],
[5,3,2.5,1.5,4,0,1.5,3,9,7],
[6,4,4,2.5,5,1.5,0,2,4,8],
[7,6,5,4,7,3,2,0,4,3],
[12,9,8,8,10,6,5,5,0,2.5],
[10,7,6,4,8,4,3,3,2,0]] # путь(примерный) от n-1 -отделения, начиная с i = 0, до j-отделения, j = [1...9]

nonZeroRoads = 9
totalLength = 0
average = []
for i in range(n):
    for j in range(n):
        totalLength += distances[i][j]
        if j == 9:
            averageLength = totalLength / nonZeroRoads
            average.append(averageLength)
            totalLength = 0

print(average)  #  анализируя содержимое average, приходим к выводу,
                #  что в среднем путь от отделения 92 до остальных на 2 км больше
